* TODO Find out about setting up a user agreement for onping
* TODO Fix cobalt kiosk backend to use forms for indexing
* TODO Look over goals and see what progress we have made.  
* TODO Look over Steve's stuff
** I sent this off for Daniel to look for  
* TODO rename filterDataTemplateEntry
** TODO I need to investigate why this was needed soon                 :what:
* TODO extract permissions
** This turned out to be an unwise thing for now  
* TODO Add broadcast handling
* TODO More Automation for tish report
* TODO Look over contract 
* TODO Check that Modbus TCP is good
* TODO MODBUS on IPAD
* TODO Finish render Heading in issue-add
  CLOCK: [2015-05-23 Sat 00:05]--[2015-05-23 Sat 00:25] =>  0:20
** TODO Render section
   CLOCK: [2015-05-23 Sat 00:25]--[2015-05-23 Sat 00:35] =>  0:10
* TODO Furnish Steve his quote
  CLOCK: [2015-05-19 Tue 15:34]--[2015-05-19 Tue 16:28] =>  0:54
  I put a hold on this until I get things in proper condition to actually add the report and driver info
* TODO NodeManager might need to be updated
